---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceRoughness
source: html/0093b0c5-8696-f4bb-571c-7836db9849b4.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceRoughness Property

The property labeled "Roughness" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string SurfaceRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.